/*
Задание: Сделайте функцию, которая параметрами принимает 2 числа.
Если их сумма больше 10 - пусть функция вернет true, а если нет - false.
*/
public class Main {
    public static void main(String[] args) {
        //напишите тут ваш код
    System.out.println(po(7,4));}    
        public static boolean po(int a, int b){
            int c =0;
            c= a+b;
            if (c>10)
                return true;
            else
            return  false;
        }
    }
